-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- 主机： localhost
-- 生成日期： 2023-11-22 09:42:03
-- 服务器版本： 10.11.2-MariaDB
-- PHP 版本： 8.0.28

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 数据库： `iptv`
--

-- --------------------------------------------------------

--
-- 表的结构 `dsmtv_movie`
--

CREATE TABLE `dsmtv_movie` (
  `id` int(11) NOT NULL,
  `name` text NOT NULL,
  `api` text DEFAULT NULL,
  `state` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- 表的结构 `iptv_admin`
--

CREATE TABLE `iptv_admin` (
  `id` int(11) NOT NULL,
  `name` varchar(16) NOT NULL,
  `psw` varchar(32) NOT NULL,
  `showcounts` tinyint(1) NOT NULL DEFAULT 20,
  `author` tinyint(1) NOT NULL DEFAULT 0,
  `useradmin` tinyint(1) NOT NULL DEFAULT 0,
  `ipcheck` tinyint(1) NOT NULL DEFAULT 0,
  `epgadmin` tinyint(1) NOT NULL DEFAULT 0,
  `mealsadmin` tinyint(1) NOT NULL DEFAULT 0,
  `channeladmin` tinyint(1) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 转存表中的数据 `iptv_admin`
--

INSERT INTO `iptv_admin` (`id`, `name`, `psw`, `showcounts`, `author`, `useradmin`, `ipcheck`, `epgadmin`, `mealsadmin`, `channeladmin`) VALUES
(1, 'admin', 'a68b2b08ac78fa0715ab457e4d7dca9e', 20, 1, 1, 1, 1, 1, 1);

-- --------------------------------------------------------

--
-- 表的结构 `iptv_adminrec`
--

CREATE TABLE `iptv_adminrec` (
  `id` int(11) NOT NULL,
  `name` varchar(16) NOT NULL,
  `ip` varchar(46) NOT NULL,
  `loc` varchar(32) DEFAULT NULL,
  `time` varchar(64) NOT NULL,
  `func` varchar(64) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- 表的结构 `iptv_category`
--

CREATE TABLE `iptv_category` (
  `id` int(11) NOT NULL,
  `name` varchar(16) NOT NULL,
  `enable` tinyint(1) NOT NULL DEFAULT 1,
  `psw` varchar(16) DEFAULT NULL,
  `type` varchar(16) NOT NULL DEFAULT 'default',
  `url` varchar(1024) DEFAULT NULL,
  `autocategory` varchar(16) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- 表的结构 `iptv_channels`
--

CREATE TABLE `iptv_channels` (
  `id` int(11) NOT NULL,
  `name` varchar(50) NOT NULL,
  `url` varchar(1024) DEFAULT NULL,
  `category` varchar(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 转存表中的数据 `iptv_channels`
--

-- --------------------------------------------------------

--
-- 表的结构 `iptv_config`
--

CREATE TABLE `iptv_config` (
  `id` int(11) NOT NULL,
  `name` varchar(32) NOT NULL,
  `value` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 转存表中的数据 `iptv_config`
--

INSERT INTO `iptv_config` (`id`, `name`, `value`) VALUES
(1, 'adinfo', '本IPTV系统仅用于个人非商业用途，任何使用本系统的用户需自行承担风险。使用本系统可能会涉及到访问第三方资源，包括但不限于通过互联网获取的流媒体内容、频道列表等。我们无法控制这些第三方资源的可用性、质量、安全性或合法性。我们不对使用本系统产生的任何损失、损害或法律责任承担责任。使用者必须自行判断并承担使用本系统所带来的风险。在使用本系统之前，请确保您已获得了相关法律法规和版权所有者的许可。'),
(2, 'adtext', '本IPTV系统仅用于个人非商业用途，任何使用本系统的用户需自行承担风险。使用本系统可能会涉及到访问第三方资源，包括但不限于通过互联网获取的流媒体内容、频道列表等。我们无法控制这些第三方资源的可用性、质量、安全性或合法性。我们不对使用本系统产生的任何损失、损害或法律责任承担责任。使用者必须自行判断并承担使用本系统所带来的风险。在使用本系统之前，请确保您已获得了相关法律法规和版权所有者的许可。'),
(3, 'appurl', 'https://127.0.0.1/tv.apk'),
(4, 'appurl_sdk14', 'https://127.0.0.1/tv_sdk14.apk'),
(5, 'appver', '1.0'),
(6, 'appver_sdk14', '1.0'),
(7, 'app_appname', '清和电视'),
(8, 'app_packagename', 'cn.dsmtv.player'),
(9, 'app_sign', '12315'),
(10, 'autoupdate', '1'),
(11, 'buffTimeOut', '30'),
(12, 'dataver', '1'),
(13, 'decoder', '2'),
(14, 'epg_api_chk', '0'),
(15, 'ipcount', '2'),
(16, 'ipchk', '4'),
(17, 'max_sameip_user', '999'),
(18, 'needauthor', '1'),
(19, 'randkey', '6d7caa26b6de5941e3b24fd7c573d0bb'),
(20, 'secret_key', NULL),
(21, 'setver', '6'),
(22, 'showtime', '120'),
(23, 'showinterval', '5'),
(24, 'showwea', '0'),
(25, 'tipepgerror_1000', '1000_EPG接口验证失败!'),
(26, 'tipepgerror_1001', '1001_EPG接口验证失败系!'),
(27, 'tipepgerror_1002', '1002_EPG接口验证失败!'),
(28, 'tipepgerror_1003', '1003_EPG接口验证失败!'),
(29, 'tipepgerror_1004', '1004_EPG接口验证失败!'),
(30, 'tipepgerror_1005', '1005_EPG接口验证失败!'),
(31, 'tiploading', '正在连接，请稍后 ...'),
(32, 'tipuserexpired', '账号已到期，请联系公众号客服续费。'),
(33, 'tipuserforbidden', '账号已禁用，请联系公众号客服。'),
(34, 'tipusernoreg', '未被授权使用，请联系公众号客服，@iptv的工作室。'),
(35, 'trialdays', '-999'),
(36, 'updateinterval', '10'),
(37, 'up_size', '0.0M'),
(38, 'up_sets', '0'),
(39, 'up_text', '1.公告测试'),
(40, 'weaapi_id', '75825241'),
(41, 'weaapi_key', 'FBrRgz4e'),
(42, 'alipay_appid', NULL),
(43, 'alipay_privatekey', NULL),
(44, 'alipay_publickey', NULL);

-- --------------------------------------------------------

--
-- 表的结构 `iptv_epg`
--

CREATE TABLE `iptv_epg` (
  `id` int(11) NOT NULL,
  `name` varchar(64) NOT NULL,
  `content` text DEFAULT NULL,
  `status` tinyint(1) NOT NULL DEFAULT 1,
  `remarks` varchar(64) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 转存表中的数据 `iptv_epg`
--

INSERT INTO `iptv_epg` (`id`, `name`, `content`, `status`, `remarks`) VALUES
(1, 'cntv-cctv1', 'CCTV1「IPV6」,CCTV1,CCTV1HEVC,CCTV-1,CCTV-1综合', 1, 'CCTV1|CCTV-1'),
(2, 'cntv-cctv2', 'CCTV-2,CCTV2「IPV6」,CCTV2,CCTV2HEVC,CCTV-2财经', 1, 'CCTV2|CCTV-2'),
(3, 'cntv-cctv3', 'CCTV-3,CCTV3「IPV6」,CCTV3,CCTV3HEVC,CCTV-3综艺', 1, 'CCTV3|CCTV-3'),
(4, 'cntv-cctv4', 'CCTV-4,CCTV4「IPV6」,CCTV4,CCTV4HEVC,CCTV-4中文国际', 1, 'CCTV4|CCTV-4'),
(5, 'cntv-cctv5', 'CCTV-5,CCTV5「IPV6」,CCTV5,CCTV5HEVC,CCTV-5体育', 1, 'CCTV5|CCTV-5'),
(6, 'cntv-cctv5plus', 'CCTV-5+,CCTV5+,CCTV5+HEVC,CCTV-5+体育赛事', 1, 'CCTV5+|CCTV-5+'),
(7, 'cntv-cctv6', 'CCTV-6,CCTV6「IPV6」,CCTV6,CCTV6HEVC,CCTV-6电影', 1, 'CCTV6|CCTV-6'),
(8, 'cntv-cctv7', 'CCTV-7,CCTV7「IPV6」,CCTV7,CCTV7HEVC,CCTV-7军事·农业', 1, 'CCTV7|CCTV-7'),
(9, 'cntv-cctv8', 'CCTV-8,CCTV8「IPV6」,CCTV8,CCTV8HEVC,CCTV-8电视剧', 1, 'CCTV8|CCTV-8'),
(10, 'cntv-cctvjilu', 'CCTV-9,CCTV9「IPV6」,CCTV9,CCTV9HEVC,CCTV-9纪录', 1, 'CCTV9|CCTV-9'),
(11, 'cntv-cctv10', 'CCTV-10,CCTV10「IPV6」,CCTV10,CCTV10HEVC,CCTV-10科教', 1, 'CCTV10|CCTV-10'),
(12, 'cntv-cctv11', 'CCTV-11,CCTV11「IPV6」,CCTV11,CCTV11HEVC', 1, 'CCTV11|CCTV-11'),
(13, 'cntv-cctv12', 'CCTV-12,CCTV12「IPV6」,CCTV12,CCTV12HEVC,CCTV-12社会与法', 1, 'CCTV12|CCTV-12'),
(14, 'cntv-cctv13', 'CCTV-13,CCTV13「IPV6」,CCTV13,CCTV13HEVC,CCTV-13新闻', 1, 'CCTV13|CCTV-13'),
(15, 'cntv-cctvchild', 'CCTV-14,CCTV14「IPV6」,CCTV14,CCTV14HEVC,CCTV-14少儿', 1, 'CCTV14|CCTV-14'),
(16, 'cntv-cctv15', 'CCTV-15,CCTV15「IPV6」,CCTV15,CCTV15HEVC,CCTV-15音乐', 1, 'CCTV15|CCTV-15'),
(17, 'cntv-cctv16', 'CCTV-16,CCTV16「IPV6」,CCTV16,CCTV16-4K,CCTV-16奥林匹克', 1, 'CCTV16|CCTV-16'),
(18, 'cntv-cctv17', 'CCTV-17,CCTV17「IPV6」,CCTV17,CCTV17HEVC,CCTV-17农业农村', 1, 'CCTV17|CCTV-17'),
(19, '112114-4K综艺', '4K综艺', 1, '4K综艺'),
(20, '112114-ABCAUSTRALIA', 'ABCAUSTRALIA', 1, 'ABCAUSTRALIA'),
(21, '112114-ALJAZEERA', 'ALJAZEERA', 1, 'ALJAZEERA'),
(22, '112114-AMC', 'AMC', 1, 'AMC'),
(23, '112114-ANIMAX', 'ANIMAX', 1, 'ANIMAX'),
(24, '112114-ARIRANGTV', 'ARIRANGTV', 1, 'ARIRANGTV'),
(25, '112114-AXN', 'AXN', 1, 'AXN'),
(26, '112114-BBCEARTH', 'BBCEARTH', 1, 'BBCEARTH'),
(27, '112114-BBCLIFESTYLE', 'BBCLIFESTYLE', 1, 'BBCLIFESTYLE'),
(28, '112114-BBCWORLDNEWS', 'BBCWORLDNEWS', 1, 'BBCWORLDNEWS'),
(29, '112114-BLOOMBERGTV', 'BLOOMBERGTV', 1, 'BLOOMBERGTV'),
(30, '112114-BLUEANTENTERTAINMENT', 'BLUEANTENTERTAINMENT', 1, 'BLUEANTENTERTAINMENT'),
(31, '112114-BLUEANTEXTREME', 'BLUEANTEXTREME', 1, 'BLUEANTEXTREME'),
(32, '112114-BOOMERANG', 'BOOMERANG', 1, 'BOOMERANG'),
(33, '112114-BTV体育', 'BTV体育', 1, 'BTV体育'),
(34, '112114-BTV影视', 'BTV影视', 1, 'BTV影视'),
(35, '112114-BTV文艺', 'BTV文艺', 1, 'BTV文艺'),
(36, '112114-BTV新闻', 'BTV新闻', 1, 'BTV新闻'),
(37, '112114-BTV生活', 'BTV生活', 1, 'BTV生活'),
(38, '112114-BTV科教', 'BTV科教', 1, 'BTV科教'),
(39, '112114-BTV财经', 'BTV财经', 1, 'BTV财经'),
(40, '112114-CATCHPLAY电影', 'CATCHPLAY电影', 1, 'CATCHPLAY电影'),
(41, '112114-CBEEBIES', 'CBEEBIES', 1, 'CBEEBIES'),
(42, '112114-CCTV4K', 'CCTV4K,CCTV-4K', 1, 'CCTV4K|CCTV-4K'),
(43, '112114-CCTV4欧洲', 'CCTV-4欧洲', 1, 'CCTV4欧洲|CCTV-4欧洲'),
(44, '112114-CCTV4美洲', 'CCTV-4美洲', 1, 'CCTV4美洲|CCTV-4美洲'),
(45, '112114-CCTV8K', 'CCTV8K,CCTV-8K', 1, 'CCTV8K|CCTV-8K'),
(46, '112114-CCTV娱乐', 'CCTV娱乐', 1, 'CCTV娱乐'),
(47, '112114-CCTV怀旧剧场', 'CCTV怀旧剧场', 1, 'CCTV怀旧剧场'),
(48, '112114-CCTV戏曲', 'CCTV戏曲', 1, 'CCTV戏曲'),
(49, '112114-CCTV第一剧场', 'CCTV第一剧场', 1, 'CCTV第一剧场'),
(50, '112114-CCTV风云剧场', 'CCTV风云剧场', 1, 'CCTV风云剧场'),
(51, '112114-CDTV1', 'CDTV1', 1, 'CDTV1'),
(52, '112114-CDTV2', 'CDTV2', 1, 'CDTV2'),
(53, '112114-CDTV3', 'CDTV3', 1, 'CDTV3'),
(54, '112114-CDTV4', 'CDTV4', 1, 'CDTV4'),
(55, '112114-CDTV5', 'CDTV5', 1, 'CDTV5'),
(56, '112114-CDTV6', 'CDTV6', 1, 'CDTV6'),
(57, '112114-CGTN', 'CGTN', 1, 'CGTN'),
(58, '112114-CGTN俄语', 'CGTN俄语', 1, 'CGTN俄语'),
(59, '112114-CGTN法语', 'CGTN法语', 1, 'CGTN法语'),
(60, '112114-CGTN纪录', 'CGTN纪录', 1, 'CGTN纪录'),
(61, '112114-CGTN西语', 'CGTN西语', 1, 'CGTN西语'),
(62, '112114-CGTN阿语', 'CGTN阿语', 1, 'CGTN阿语'),
(63, '112114-CHANGZHOU4', 'CHANGZHOU4', 1, 'CHANGZHOU4'),
(64, '112114-CHANNELNEWSASIA', 'CHANNELNEWSASIA', 1, 'CHANNELNEWSASIA'),
(65, '112114-CHC动作电影', 'CHC动作电影', 1, 'CHC动作电影'),
(66, '112114-CHC家庭影院', 'CHC家庭影院', 1, 'CHC家庭影院'),
(67, '112114-CHC高清电影', 'CHC高清电影', 1, 'CHC高清电影'),
(68, '112114-CI', 'CI', 1, 'CI'),
(69, '112114-CINEMAWORLD', 'CINEMAWORLD', 1, 'CINEMAWORLD'),
(70, '112114-CINEMAX', 'CINEMAX', 1, 'CINEMAX'),
(71, '112114-CNBCHONGKONG', 'CNBCHONGKONG', 1, 'CNBCHONGKONG'),
(72, '112114-CNEX', 'CNEX', 1, 'CNEX'),
(73, '112114-DISCOVERYASIA', 'DISCOVERYASIA', 1, 'DISCOVERYASIA'),
(74, '112114-DISCOVERY科学', 'DISCOVERY科学', 1, 'DISCOVERY科学'),
(75, '112114-DMAX', 'DMAX', 1, 'DMAX'),
(76, '112114-DOX剧场', 'DOX剧场', 1, 'DOX剧场'),
(77, '112114-DOX英伦', 'DOX英伦', 1, 'DOX英伦'),
(78, '112114-DOX雅趣', 'DOX雅趣', 1, 'DOX雅趣'),
(79, '112114-DREAMWORKS', 'DREAMWORKS', 1, 'DREAMWORKS'),
(80, '112114-DW', 'DW', 1, 'DW'),
(81, '112114-ELEVEN体育二台', 'ELEVEN体育二台', 1, 'ELEVEN体育二台'),
(82, '112114-ELTV', 'ELTV', 1, 'ELTV'),
(83, '112114-ETTODAY', 'ETTODAY', 1, 'ETTODAY'),
(84, '112114-EURONEWS', 'EURONEWS', 1, 'EURONEWS'),
(85, '112114-EUROSPORT', 'EUROSPORT', 1, 'EUROSPORT'),
(86, '112114-EVE', 'EVE', 1, 'EVE'),
(87, '112114-EYE戏剧', 'EYE戏剧', 1, 'EYE戏剧'),
(88, '112114-EYE旅游', 'EYE旅游', 1, 'EYE旅游'),
(89, '112114-FASHIONTV', 'FASHIONTV', 1, 'FASHIONTV'),
(90, '112114-FOODNETWORK美食台', 'FOODNETWORK美食台', 1, 'FOODNETWORK美食台'),
(91, '112114-FOX', 'FOX', 1, 'FOX'),
(92, '112114-FRANCE24', 'FRANCE24', 1, 'FRANCE24'),
(93, '112114-GOODTV', 'GOODTV', 1, 'GOODTV'),
(94, '112114-GOODTV2', 'GOODTV2', 1, 'GOODTV2'),
(95, '112114-GTV游戏竞技', 'GTV游戏竞技', 1, 'GTV游戏竞技'),
(96, '112114-HBO', 'HBO', 1, 'HBO'),
(97, '112114-HBOFAMILY', 'HBOFAMILY', 1, 'HBOFAMILY'),
(98, '112114-HBOHD', 'HBOHD', 1, 'HBOHD'),
(99, '112114-HBOHITS', 'HBOHITS', 1, 'HBOHITS'),
(100, '112114-HBOSIGNATURE', 'HBOSIGNATURE', 1, 'HBOSIGNATURE'),
(101, '112114-HGTV居家乐活', 'HGTV居家乐活', 1, 'HGTV居家乐活'),
(102, '112114-HISTORY', 'HISTORY', 1, 'HISTORY'),
(103, '112114-HITS', 'HITS', 1, 'HITS'),
(104, '112114-HKS', 'HKS', 1, 'HKS'),
(105, '112114-HUBEI7', 'HUBEI7', 1, 'HUBEI7'),
(106, '112114-HZTV1', 'HZTV1', 1, 'HZTV1'),
(107, '112114-HZTV2', 'HZTV2', 1, 'HZTV2'),
(108, '112114-IFUN1', 'IFUN1', 1, 'IFUN1'),
(109, '112114-IFUN3', 'IFUN3', 1, 'IFUN3'),
(110, '112114-IPTV5+', 'IPTV5+', 1, 'IPTV5+'),
(111, '112114-IPTV6+', 'IPTV6+', 1, 'IPTV6+'),
(112, '112114-IPTV少儿动画', 'IPTV少儿动画', 1, 'IPTV少儿动画'),
(113, '112114-IPTV法治', 'IPTV法治', 1, 'IPTV法治'),
(114, '112114-IPTV热播剧场', 'IPTV热播剧场', 1, 'IPTV热播剧场'),
(115, '112114-IPTV爱体育', 'IPTV爱体育', 1, 'IPTV爱体育'),
(116, '112114-IPTV相声小品', 'IPTV相声小品', 1, 'IPTV相声小品'),
(117, '112114-IPTV经典电影', 'IPTV经典电影', 1, 'IPTV经典电影'),
(118, '112114-IPTV谍战剧场', 'IPTV谍战剧场', 1, 'IPTV谍战剧场'),
(119, '112114-IPTV野外', 'IPTV野外', 1, 'IPTV野外'),
(120, '112114-IPTV魅力时尚', 'IPTV魅力时尚', 1, 'IPTV魅力时尚'),
(121, '112114-J2', 'J2', 1, 'J2'),
(122, '112114-LIFETIME', 'LIFETIME', 1, 'LIFETIME'),
(123, '112114-LSTIME电影台', 'LSTIME电影台', 1, 'LSTIME电影台'),
(124, '112114-LUXETV', 'LUXETV', 1, 'LUXETV'),
(125, '112114-MEZZOLIVEHD', 'MEZZOLIVEHD', 1, 'MEZZOLIVEHD'),
(126, '112114-MOMO亲子台', 'MOMO亲子台', 1, 'MOMO亲子台'),
(127, '112114-MTV', 'MTV', 1, 'MTV'),
(128, '112114-MTV综合', 'MTV综合', 1, 'MTV综合'),
(129, '112114-MYCINEMAEUROPE', 'MYCINEMAEUROPE', 1, 'MYCINEMAEUROPE'),
(130, '112114-NHKWORLDPREMIUM', 'NHKWORLDPREMIUM', 1, 'NHKWORLDPREMIUM'),
(131, '112114-NICKELODEON', 'NICKELODEON', 1, 'NICKELODEON'),
(132, '112114-NICKJR.', 'NICKJR.', 1, 'NICKJR.'),
(133, '112114-NOW剧集台', 'NOW剧集台', 1, 'NOW剧集台'),
(134, '112114-NOW华剧台', 'NOW华剧台', 1, 'NOW华剧台'),
(135, '112114-NOW影视点播站', 'NOW影视点播站', 1, 'NOW影视点播站'),
(136, '112114-NOW新闻台', 'NOW新闻台', 1, 'NOW新闻台'),
(137, '112114-NOW爆谷台', 'NOW爆谷台', 1, 'NOW爆谷台'),
(138, '112114-NOW爆谷星影台', 'NOW爆谷星影台', 1, 'NOW爆谷星影台'),
(139, '112114-NOW直播台', 'NOW直播台', 1, 'NOW直播台'),
(140, '112114-NOW财经台', 'NOW财经台', 1, 'NOW财经台'),
(141, '112114-OUTDOOR', 'OUTDOOR', 1, 'OUTDOOR'),
(142, '112114-QHTV1', 'QHTV1', 1, 'QHTV1'),
(143, '112114-QTV-1', 'QTV-1', 1, 'QTV-1'),
(144, '112114-QTV-2', 'QTV-2', 1, 'QTV-2'),
(145, '112114-ROLLOR', 'ROLLOR', 1, 'ROLLOR'),
(146, '112114-SBN全球财经台', 'SBN全球财经台', 1, 'SBN全球财经台'),
(147, '112114-SCTV1', 'SCTV1', 1, 'SCTV1'),
(148, '112114-SCTV2', 'SCTV2', 1, 'SCTV2'),
(149, '112114-SCTV3', 'SCTV3', 1, 'SCTV3'),
(150, '112114-SCTV4', 'SCTV4', 1, 'SCTV4'),
(151, '112114-SCTV5', 'SCTV5', 1, 'SCTV5'),
(152, '112114-SCTV7', 'SCTV7', 1, 'SCTV7'),
(153, '112114-SCTV8', 'SCTV8', 1, 'SCTV8'),
(154, '112114-SCTV9', 'SCTV9', 1, 'SCTV9'),
(155, '112114-SHHAI1', 'SHHAI1', 1, 'SHHAI1'),
(156, '112114-SITV14', 'SITV14', 1, 'SITV14'),
(157, '112114-SKYNEWS', 'SKYNEWS', 1, 'SKYNEWS'),
(158, '112114-SMART知识', 'SMART知识', 1, 'SMART知识'),
(159, '112114-SONYMAX', 'SONYMAX', 1, 'SONYMAX'),
(160, '112114-SONYSAB', 'SONYSAB', 1, 'SONYSAB'),
(161, '112114-STARMOVIESHD', 'STARMOVIESHD', 1, 'STARMOVIESHD'),
(162, '112114-TFC', 'TFC', 1, 'TFC'),
(163, '112114-TLC旅游生活', 'TLC旅游生活', 1, 'TLC旅游生活'),
(164, '112114-TRACESPORTS', 'TRACESPORTS', 1, 'TRACESPORTS'),
(165, '112114-TRACEURBAN', 'TRACEURBAN', 1, 'TRACEURBAN'),
(166, '112114-TRAVELCHANNEL', 'TRAVELCHANNEL', 1, 'TRAVELCHANNEL'),
(167, '112114-TV5MONDE', 'TV5MONDE', 1, 'TV5MONDE'),
(168, '112114-TVBS新闻台', 'TVBS新闻台,TVBS新聞台,TVBS新聞', 1, 'TVBS新闻台|TVBS新聞台|TVBS新聞'),
(169, '112114-TVBS欢乐台', 'TVBS欢乐台,TVBS歡樂台', 1, 'TVBS欢乐台|TVBS歡樂台'),
(170, '112114-TVBS精采台', 'TVBS精采台,TVBS精採台', 1, 'TVBS精采台|TVBS精採台'),
(171, '112114-TVB剧场', 'TVB剧场', 1, 'TVB剧场'),
(172, '112114-TVB粤语片台', 'TVB粤语片台', 1, 'TVB粤语片台'),
(173, '112114-TVB经典台', 'TVB经典台', 1, 'TVB经典台'),
(174, '112114-TVN', 'TVN', 1, 'TVN'),
(175, '112114-VIUTV', 'VIUTV', 1, 'VIUTV'),
(176, '112114-VIUTVSIX', 'VIUTVSIX', 1, 'VIUTVSIX'),
(177, '112114-WARNERTV', 'WARNERTV', 1, 'WARNERTV'),
(178, '112114-七彩戏剧', '七彩戏剧', 1, '七彩戏剧'),
(179, '112114-三沙卫视', '三沙卫视', 1, '三沙卫视'),
(180, '112114-三立戏剧', '三立戏剧', 1, '三立戏剧'),
(181, '112114-三立综合台', '三立综合台', 1, '三立综合台'),
(182, '112114-三立财经新闻台', '三立财经新闻台', 1, '三立财经新闻台'),
(183, '112114-上海', '上海', 1, '上海'),
(184, '112114-上海教育台', '上海教育台', 1, '上海教育台'),
(185, '112114-上海新闻综合', '上海新闻综合', 1, '上海新闻综合'),
(186, '112114-上海第一财经', '上海第一财经', 1, '上海第一财经'),
(187, '112114-上海纪实', '上海纪实', 1, '上海纪实'),
(188, '112114-上海纪实人文', '上海纪实人文', 1, '上海纪实人文'),
(189, '112114-上海都市', '上海都市', 1, '上海都市'),
(190, '112114-上视东方影视', '上视东方影视', 1, '上视东方影视'),
(191, '112114-上视新闻', '上视新闻', 1, '上视新闻'),
(192, '112114-上视纪实', '上视纪实', 1, '上视纪实'),
(193, '112114-世界地理', '世界地理', 1, '世界地理'),
(194, '112114-东南卫视', '东南卫视', 1, '东南卫视'),
(195, '112114-东方卫视', '东方卫视', 1, '东方卫视'),
(196, '112114-东方影视', '东方影视', 1, '东方影视'),
(197, '112114-东森亚洲卫视', '东森亚洲卫视', 1, '东森亚洲卫视'),
(198, '112114-东森亚洲新闻台', '东森亚洲新闻台', 1, '东森亚洲新闻台'),
(199, '112114-东森新闻台', '东森新闻台', 1, '东森新闻台'),
(200, '112114-东森财经新闻台', '东森财经新闻台', 1, '东森财经新闻台'),
(201, '112114-东莞新闻', '东莞新闻', 1, '东莞新闻'),
(202, '112114-东莞新闻综合', '东莞新闻综合', 1, '东莞新闻综合'),
(203, '112114-东莞生活资讯', '东莞生活资讯', 1, '东莞生活资讯'),
(204, '112114-东风卫视', '东风卫视', 1, '东风卫视'),
(205, '112114-中华特产', '中华特产', 1, '中华特产'),
(206, '112114-中国交通', '中国交通', 1, '中国交通'),
(207, '112114-中国天气', '中国天气', 1, '中国天气'),
(208, '112114-中国教育1台', '中国教育1台', 1, '中国教育1台'),
(209, '112114-中国教育2台', '中国教育2台', 1, '中国教育2台'),
(210, '112114-中国教育3台', '中国教育3台', 1, '中国教育3台'),
(211, '112114-中国教育4台', '中国教育4台', 1, '中国教育4台'),
(212, '112114-中天亚洲台', '中天亚洲台', 1, '中天亚洲台'),
(213, '112114-中天新闻台', '中天新闻台', 1, '中天新闻台'),
(214, '112114-中央', '中央', 1, '中央'),
(215, '112114-中央台–珠江', '中央台–珠江', 1, '中央台–珠江'),
(216, '112114-中学生', '中学生', 1, '中学生'),
(217, '112114-中山公共', '中山公共', 1, '中山公共'),
(218, '112114-中山教育', '中山教育', 1, '中山教育'),
(219, '112114-中山综合', '中山综合', 1, '中山综合'),
(220, '112114-中视', '中视', 1, '中视'),
(221, '112114-中视新闻', '中视新闻', 1, '中视新闻'),
(222, '112114-中视经典', '中视经典', 1, '中视经典'),
(223, '112114-中视菁采台', '中视菁采台', 1, '中视菁采台'),
(224, '112114-义乌公共文艺', '义乌公共文艺', 1, '义乌公共文艺'),
(225, '112114-义乌商贸', '义乌商贸', 1, '义乌商贸'),
(226, '112114-义乌新闻综合', '义乌新闻综合', 1, '义乌新闻综合'),
(227, '112114-云上电影院', '云上电影院', 1, '云上电影院'),
(228, '112114-云南公共', '云南公共', 1, '云南公共'),
(229, '112114-云南卫视', '云南卫视', 1, '云南卫视'),
(230, '112114-云南娱乐', '云南娱乐', 1, '云南娱乐'),
(231, '112114-云南少儿', '云南少儿', 1, '云南少儿'),
(232, '112114-云南影视', '云南影视', 1, '云南影视'),
(233, '112114-云南生活', '云南生活', 1, '云南生活'),
(234, '112114-云南都市', '云南都市', 1, '云南都市'),
(235, '112114-云浮综合', '云浮综合', 1, '云浮综合'),
(236, '112114-亚洲新闻台', '亚洲新闻台', 1, '亚洲新闻台'),
(237, '112114-亚洲旅游台', '亚洲旅游台', 1, '亚洲旅游台'),
(238, '112114-亚洲综合', '亚洲综合', 1, '亚洲综合'),
(239, '112114-亚洲美食', '亚洲美食', 1, '亚洲美食'),
(240, '112114-京视剧场', '京视剧场', 1, '京视剧场'),
(241, '112114-人间卫视', '人间卫视', 1, '人间卫视'),
(242, '112114-仙游电视', '仙游电视', 1, '仙游电视'),
(243, '112114-优漫卡通', '优漫卡通', 1, '优漫卡通'),
(244, '112114-佛卫慈悲台', '佛卫慈悲台', 1, '佛卫慈悲台'),
(245, '112114-佛山公共', '佛山公共', 1, '佛山公共'),
(246, '112114-佛山南海', '佛山南海', 1, '佛山南海'),
(247, '112114-佛山影视', '佛山影视', 1, '佛山影视'),
(248, '112114-佛山综合', '佛山综合', 1, '佛山综合'),
(249, '112114-佛山顺德', '佛山顺德', 1, '佛山顺德'),
(250, '112114-先锋乒羽', '先锋乒羽', 1, '先锋乒羽'),
(251, '112114-全纪实', '全纪实', 1, '全纪实'),
(252, '112114-八大优', '八大优', 1, '八大优'),
(253, '112114-公视', '公视', 1, '公视'),
(254, '112114-公视2', '公视2', 1, '公视2'),
(255, '112114-公视三台', '公视三台', 1, '公视三台'),
(256, '112114-六安公共', '六安公共', 1, '六安公共'),
(257, '112114-六安新闻综合', '六安新闻综合', 1, '六安新闻综合'),
(258, '112114-六安都市生活', '六安都市生活', 1, '六安都市生活'),
(259, '112114-兰州公共', '兰州公共', 1, '兰州公共'),
(260, '112114-兰州文旅', '兰州文旅', 1, '兰州文旅'),
(261, '112114-兰州新闻综合', '兰州新闻综合', 1, '兰州新闻综合'),
(262, '112114-兰州生活经济', '兰州生活经济', 1, '兰州生活经济'),
(263, '112114-兵器科技', '兵器科技', 1, '兵器科技'),
(264, '112114-兵团卫视', '兵团卫视', 1, '兵团卫视'),
(265, '112114-内蒙古农牧', '内蒙古农牧', 1, '内蒙古农牧'),
(266, '112114-内蒙古卫视', '内蒙古卫视', 1, '内蒙古卫视'),
(267, '112114-内蒙古少儿', '内蒙古少儿', 1, '内蒙古少儿'),
(268, '112114-内蒙古文体娱乐', '内蒙古文体娱乐', 1, '内蒙古文体娱乐'),
(269, '112114-内蒙古经济生活', '内蒙古经济生活', 1, '内蒙古经济生活'),
(270, '112114-冬奥纪实', '冬奥纪实', 1, '冬奥纪实'),
(271, '112114-凤凰中文', '凤凰中文', 1, '凤凰中文'),
(272, '112114-凤凰卫视中文台', '凤凰卫视中文台', 1, '凤凰卫视中文台'),
(273, '112114-凤凰卫视资讯台', '凤凰卫视资讯台', 1, '凤凰卫视资讯台'),
(274, '112114-凤凰卫视香港台', '凤凰卫视香港台', 1, '凤凰卫视香港台'),
(275, '112114-凤凰资讯', '凤凰资讯', 1, '凤凰资讯'),
(276, '112114-凤凰香港', '凤凰香港', 1, '凤凰香港'),
(277, '112114-创世电视', '创世电视', 1, '创世电视'),
(278, '112114-动漫秀场', '动漫秀场', 1, '动漫秀场'),
(279, '112114-动物星球', '动物星球', 1, '动物星球'),
(280, '112114-劲爆体育', '劲爆体育', 1, '劲爆体育'),
(281, '112114-北京4K', '北京4K', 1, '北京4K'),
(282, '112114-北京体育休闲', '北京体育休闲', 1, '北京体育休闲'),
(283, '112114-北京卫视', '北京卫视', 1, '北京卫视'),
(284, '112114-北京国际频道', '北京国际频道', 1, '北京国际频道'),
(285, '112114-北京影视', '北京影视', 1, '北京影视'),
(286, '112114-北京文艺', '北京文艺', 1, '北京文艺'),
(287, '112114-北京新闻', '北京新闻', 1, '北京新闻'),
(288, '112114-北京淘BABY', '北京淘BABY', 1, '北京淘BABY'),
(289, '112114-北京淘剧场', '北京淘剧场', 1, '北京淘剧场'),
(290, '112114-北京淘娱乐', '北京淘娱乐', 1, '北京淘娱乐'),
(291, '112114-北京淘电影', '北京淘电影', 1, '北京淘电影'),
(292, '112114-北京淘精彩', '北京淘精彩', 1, '北京淘精彩'),
(293, '112114-北京生活', '北京生活', 1, '北京生活'),
(294, '112114-北京纪实', '北京纪实', 1, '北京纪实'),
(295, '112114-北京财经', '北京财经', 1, '北京财经'),
(296, '112114-半岛英语', '半岛英语', 1, '半岛英语'),
(297, '112114-华数亚洲影院', '华数亚洲影院', 1, '华数亚洲影院'),
(298, '112114-华数探索纪录', '华数探索纪录', 1, '华数探索纪录'),
(299, '112114-华数欧美影院', '华数欧美影院', 1, '华数欧美影院'),
(300, '112114-华数漫游世界', '华数漫游世界', 1, '华数漫游世界'),
(301, '112114-华数电子竞技', '华数电子竞技', 1, '华数电子竞技'),
(302, '112114-华数精品剧场', '华数精品剧场', 1, '华数精品剧场'),
(303, '112114-华数风尚音乐', '华数风尚音乐', 1, '华数风尚音乐'),
(304, '112114-华数高清娱乐', '华数高清娱乐', 1, '华数高清娱乐'),
(305, '112114-华纳电视', '华纳电视', 1, '华纳电视'),
(306, '112114-华艺MBC', '华艺MBC', 1, '华艺MBC'),
(307, '112114-华艺影剧', '华艺影剧', 1, '华艺影剧'),
(308, '112114-华藏卫视', '华藏卫视', 1, '华藏卫视'),
(309, '112114-华视', '华视', 1, '华视'),
(310, '112114-南京信息', '南京信息', 1, '南京信息'),
(311, '112114-南京十八', '南京十八', 1, '南京十八'),
(312, '112114-南京娱乐', '南京娱乐', 1, '南京娱乐'),
(313, '112114-南京少儿', '南京少儿', 1, '南京少儿'),
(314, '112114-南京影视', '南京影视', 1, '南京影视'),
(315, '112114-南京教科', '南京教科', 1, '南京教科'),
(316, '112114-南京新闻综合', '南京新闻综合', 1, '南京新闻综合'),
(317, '112114-南京生活', '南京生活', 1, '南京生活'),
(318, '112114-南京电视台', '南京电视台', 1, '南京电视台'),
(319, '112114-南宁影视娱乐', '南宁影视娱乐', 1, '南宁影视娱乐'),
(320, '112114-南方卫视', '南方卫视', 1, '南方卫视'),
(321, '112114-南通新闻综合', '南通新闻综合', 1, '南通新闻综合'),
(322, '112114-南通社教', '南通社教', 1, '南通社教'),
(323, '112114-博斯无限二台', '博斯无限二台', 1, '博斯无限二台'),
(324, '112114-博斯无限台', '博斯无限台', 1, '博斯无限台'),
(325, '112114-博斯网球台', '博斯网球台', 1, '博斯网球台'),
(326, '112114-博斯运动一台', '博斯运动一台', 1, '博斯运动一台'),
(327, '112114-博斯运动二台', '博斯运动二台', 1, '博斯运动二台'),
(328, '112114-博斯高球1台', '博斯高球1台', 1, '博斯高球1台'),
(329, '112114-博斯高球2台', '博斯高球2台', 1, '博斯高球2台'),
(330, '112114-博斯魅力网', '博斯魅力网', 1, '博斯魅力网'),
(331, '112114-卡酷动画', '卡酷动画', 1, '卡酷动画'),
(332, '112114-卡酷少儿', '卡酷少儿', 1, '卡酷少儿'),
(333, '112114-卫生健康', '卫生健康', 1, '卫生健康'),
(334, '112114-卫视电影台', '卫视电影台', 1, '卫视电影台'),
(335, '112114-原住民', '原住民', 1, '原住民'),
(336, '112114-厦门-3', '厦门-3', 1, '厦门-3'),
(337, '112114-厦门1套', '厦门1套', 1, '厦门1套'),
(338, '112114-厦门2', '厦门2', 1, '厦门2'),
(339, '112114-厦门一套', '厦门一套', 1, '厦门一套'),
(340, '112114-厦门二套', '厦门二套', 1, '厦门二套'),
(341, '112114-厦门卫视', '厦门卫视', 1, '厦门卫视'),
(342, '112114-厦门影视', '厦门影视', 1, '厦门影视'),
(343, '112114-厦门影视', '厦门影视', 1, '厦门影视'),
(344, '112114-厦门移动', '厦门移动', 1, '厦门移动'),
(345, '112114-厦门综合', '厦门综合', 1, '厦门综合'),
(346, '112114-发现之旅', '发现之旅', 1, '发现之旅'),
(347, '112114-台州公共', '台州公共', 1, '台州公共'),
(348, '112114-台州城市生活', '台州城市生活', 1, '台州城市生活'),
(349, '112114-台州文化生活', '台州文化生活', 1, '台州文化生活'),
(350, '112114-台州新闻综合', '台州新闻综合', 1, '台州新闻综合'),
(351, '112114-台湾戏剧', '台湾戏剧', 1, '台湾戏剧'),
(352, '112114-台视', '台视', 1, '台视'),
(353, '112114-台视新闻台', '台视新闻台', 1, '台视新闻台'),
(354, '112114-台视综合台', '台视综合台', 1, '台视综合台'),
(355, '112114-台视财经台', '台视财经台', 1, '台视财经台'),
(356, '112114-合肥新闻', '合肥新闻', 1, '合肥新闻'),
(357, '112114-吉安一套', '吉安一套', 1, '吉安一套'),
(358, '112114-吉安三套', '吉安三套', 1, '吉安三套'),
(359, '112114-吉安二套', '吉安二套', 1, '吉安二套'),
(360, '112114-吉林公共', '吉林公共', 1, '吉林公共'),
(361, '112114-吉林卫视', '吉林卫视', 1, '吉林卫视'),
(362, '112114-吉林教育', '吉林教育', 1, '吉林教育'),
(363, '112114-吉视乡村', '吉视乡村', 1, '吉视乡村'),
(364, '112114-吉视影视', '吉视影视', 1, '吉视影视'),
(365, '112114-吉视生活', '吉视生活', 1, '吉视生活'),
(366, '112114-吉视综艺文化', '吉视综艺文化', 1, '吉视综艺文化'),
(367, '112114-吉视都市', '吉视都市', 1, '吉视都市'),
(368, '112114-吴江新闻综合', '吴江新闻综合', 1, '吴江新闻综合'),
(369, '112114-咪咕24小时体育', '咪咕24小时体育', 1, '咪咕24小时体育'),
(370, '112114-咪咕NBA-1', '咪咕NBA-1', 1, '咪咕NBA-1'),
(371, '112114-咪咕综合体育', '咪咕综合体育', 1, '咪咕综合体育'),
(372, '112114-咪咕足球', '咪咕足球', 1, '咪咕足球'),
(373, '112114-哈哈炫动', '哈哈炫动', 1, '哈哈炫动'),
(374, '112114-哈尔滨新闻综合', '哈尔滨新闻综合', 1, '哈尔滨新闻综合'),
(375, '112114-唯心电视', '唯心电视', 1, '唯心电视'),
(376, '112114-嘉丽购物', '嘉丽购物', 1, '嘉丽购物'),
(377, '112114-嘉佳卡通', '嘉佳卡通', 1, '嘉佳卡通'),
(378, '112114-四川卫视', '四川卫视', 1, '四川卫视'),
(379, '112114-四川经济', '四川经济', 1, '四川经济'),
(380, '112114-四海钓鱼', '四海钓鱼', 1, '四海钓鱼'),
(381, '112114-国兴卫视', '国兴卫视', 1, '国兴卫视'),
(382, '112114-国学', '国学', 1, '国学'),
(383, '112114-国家地理高清', '国家地理高清', 1, '国家地理高清'),
(384, '112114-壹电视新闻台', '壹电视新闻台', 1, '壹电视新闻台'),
(385, '112114-壹电视电影台', '壹电视电影台', 1, '壹电视电影台'),
(386, '112114-壹电视综合台', '壹电视综合台', 1, '壹电视综合台'),
(387, '112114-外汇理财', '外汇理财', 1, '外汇理财'),
(388, '112114-大庆新闻综合', '大庆新闻综合', 1, '大庆新闻综合'),
(389, '112114-大湾区卫视', '大湾区卫视', 1, '大湾区卫视'),
(390, '112114-大爱一台', '大爱一台', 1, '大爱一台'),
(391, '112114-大爱二台', '大爱二台', 1, '大爱二台'),
(392, '112114-天元围棋', '天元围棋', 1, '天元围棋'),
(393, '112114-天天电视', '天天电视', 1, '天天电视'),
(394, '112114-天映经典', '天映经典', 1, '天映经典'),
(395, '112114-天津体育', '天津体育', 1, '天津体育'),
(396, '112114-天津卫视', '天津卫视', 1, '天津卫视'),
(397, '112114-天津少儿', '天津少儿', 1, '天津少儿'),
(398, '112114-天津影视', '天津影视', 1, '天津影视'),
(399, '112114-天津教育', '天津教育', 1, '天津教育'),
(400, '112114-天津文艺', '天津文艺', 1, '天津文艺'),
(401, '112114-天津新闻', '天津新闻', 1, '天津新闻'),
(402, '112114-天津都市', '天津都市', 1, '天津都市'),
(403, '112114-天龙八部集', '天龙八部集', 1, '天龙八部集'),
(404, '112114-太原影视', '太原影视', 1, '太原影视'),
(405, '112114-太原教育', '太原教育', 1, '太原教育'),
(406, '112114-太原文体', '太原文体', 1, '太原文体'),
(407, '112114-太原新闻综合', '太原新闻综合', 1, '太原新闻综合'),
(408, '112114-太原百姓', '太原百姓', 1, '太原百姓'),
(409, '112114-太原社教法制', '太原社教法制', 1, '太原社教法制'),
(410, '112114-央广健康', '央广健康', 1, '央广健康'),
(411, '112114-央视台球', '央视台球', 1, '央视台球'),
(412, '112114-央视精品', '央视精品', 1, '央视精品'),
(413, '112114-女性时尚', '女性时尚', 1, '女性时尚'),
(414, '112114-宁夏公共', '宁夏公共', 1, '宁夏公共'),
(415, '112114-宁夏卫视', '宁夏卫视', 1, '宁夏卫视'),
(416, '112114-宁夏少儿', '宁夏少儿', 1, '宁夏少儿'),
(417, '112114-宁夏影视', '宁夏影视', 1, '宁夏影视'),
(418, '112114-宁夏教育', '宁夏教育', 1, '宁夏教育'),
(419, '112114-宁夏经济', '宁夏经济', 1, '宁夏经济'),
(420, '112114-安徽公共', '安徽公共', 1, '安徽公共'),
(421, '112114-安徽农业科教', '安徽农业科教', 1, '安徽农业科教'),
(422, '112114-安徽卫视', '安徽卫视', 1, '安徽卫视'),
(423, '112114-安徽影视', '安徽影视', 1, '安徽影视'),
(424, '112114-安徽科教', '安徽科教', 1, '安徽科教'),
(425, '112114-安徽经济生活', '安徽经济生活', 1, '安徽经济生活'),
(426, '112114-安徽经视', '安徽经视', 1, '安徽经视'),
(427, '112114-安徽综艺', '安徽综艺', 1, '安徽综艺'),
(428, '112114-安徽综艺体育', '安徽综艺体育', 1, '安徽综艺体育'),
(429, '112114-客家生活', '客家生活', 1, '客家生活'),
(430, '112114-客家电视台', '客家电视台', 1, '客家电视台'),
(431, '112114-家庭理财', '家庭理财', 1, '家庭理财'),
(432, '112114-寰宇HD综合', '寰宇HD综合', 1, '寰宇HD综合'),
(433, '112114-寰宇新闻', '寰宇新闻', 1, '寰宇新闻'),
(434, '112114-寰宇财经', '寰宇财经', 1, '寰宇财经'),
(435, '112114-少儿动漫', '少儿动漫', 1, '少儿动漫'),
(436, '112114-山东体育', '山东体育', 1, '山东体育'),
(437, '112114-山东公共', '山东公共', 1, '山东公共'),
(438, '112114-山东农科', '山东农科', 1, '山东农科'),
(439, '112114-山东卫视', '山东卫视', 1, '山东卫视'),
(440, '112114-山东少儿', '山东少儿', 1, '山东少儿'),
(441, '112114-山东影视', '山东影视', 1, '山东影视'),
(442, '112114-山东教育', '山东教育', 1, '山东教育'),
(443, '112114-山东教育卫视', '山东教育卫视', 1, '山东教育卫视'),
(444, '112114-山东文旅', '山东文旅', 1, '山东文旅'),
(445, '112114-山东新闻', '山东新闻', 1, '山东新闻'),
(446, '112114-山东生活', '山东生活', 1, '山东生活'),
(447, '112114-山东综艺', '山东综艺', 1, '山东综艺'),
(448, '112114-山东齐鲁', '山东齐鲁', 1, '山东齐鲁'),
(449, '112114-山西公共', '山西公共', 1, '山西公共'),
(450, '112114-山西卫视', '山西卫视', 1, '山西卫视'),
(451, '112114-山西影视', '山西影视', 1, '山西影视'),
(452, '112114-山西社会与法治', '山西社会与法治', 1, '山西社会与法治'),
(453, '112114-山西经济', '山西经济', 1, '山西经济'),
(454, '112114-岳阳新闻', '岳阳新闻', 1, '岳阳新闻'),
(455, '112114-峨嵋电影', '峨嵋电影', 1, '峨嵋电影'),
(456, '112114-常州公共', '常州公共', 1, '常州公共'),
(457, '112114-常州新闻', '常州新闻', 1, '常州新闻'),
(458, '112114-常州生活', '常州生活', 1, '常州生活'),
(459, '112114-常州都市', '常州都市', 1, '常州都市'),
(460, '112114-常德公共', '常德公共', 1, '常德公共'),
(461, '112114-常德图文', '常德图文', 1, '常德图文'),
(462, '112114-常德新闻', '常德新闻', 1, '常德新闻'),
(463, '112114-常德都市', '常德都市', 1, '常德都市'),
(464, '112114-幸福彩', '幸福彩', 1, '幸福彩'),
(465, '112114-幸福空间居家台', '幸福空间居家台', 1, '幸福空间居家台'),
(466, '112114-幼儿教育', '幼儿教育', 1, '幼儿教育'),
(467, '112114-广东4K超', '广东4K超', 1, '广东4K超'),
(468, '112114-广东体育', '广东体育', 1, '广东体育'),
(469, '112114-广东公共', '广东公共', 1, '广东公共'),
(470, '112114-广东卫视', '广东卫视', 1, '广东卫视'),
(471, '112114-广东国际', '广东国际', 1, '广东国际'),
(472, '112114-广东少儿', '广东少儿', 1, '广东少儿'),
(473, '112114-广东影视', '广东影视', 1, '广东影视'),
(474, '112114-广东新闻', '广东新闻', 1, '广东新闻'),
(475, '112114-广东民生', '广东民生', 1, '广东民生'),
(476, '112114-广东现代教育', '广东现代教育', 1, '广东现代教育'),
(477, '112114-广东珠江', '广东珠江', 1, '广东珠江'),
(478, '112114-广东移动', '广东移动', 1, '广东移动'),
(479, '112114-广东经济', '广东经济', 1, '广东经济'),
(480, '112114-广东经济科教', '广东经济科教', 1, '广东经济科教'),
(481, '112114-广东综艺', '广东综艺', 1, '广东综艺'),
(482, '112114-广州影视', '广州影视', 1, '广州影视'),
(483, '112114-广州新闻', '广州新闻', 1, '广州新闻'),
(484, '112114-广州法治', '广州法治', 1, '广州法治'),
(485, '112114-广州竞赛', '广州竞赛', 1, '广州竞赛'),
(486, '112114-广州综合', '广州综合', 1, '广州综合'),
(487, '112114-广西卫视', '广西卫视', 1, '广西卫视'),
(488, '112114-广西国际', '广西国际', 1, '广西国际'),
(489, '112114-广西影视', '广西影视', 1, '广西影视'),
(490, '112114-广西新闻', '广西新闻', 1, '广西新闻'),
(491, '112114-广西综艺旅游', '广西综艺旅游', 1, '广西综艺旅游'),
(492, '112114-广西都市', '广西都市', 1, '广西都市'),
(493, '112114-康巴卫视', '康巴卫视', 1, '康巴卫视'),
(494, '112114-延边卫视', '延边卫视', 1, '延边卫视'),
(495, '112114-弈坛春秋', '弈坛春秋', 1, '弈坛春秋'),
(496, '112114-彩民在线', '彩民在线', 1, '彩民在线'),
(497, '112114-影迷数位电影', '影迷数位电影', 1, '影迷数位电影'),
(498, '112114-影迷数位纪实', '影迷数位纪实', 1, '影迷数位纪实'),
(499, '112114-快乐垂钓', '快乐垂钓', 1, '快乐垂钓'),
(500, '112114-怀化新闻综合', '怀化新闻综合', 1, '怀化新闻综合'),
(501, '112114-怀旧剧场', '怀旧剧场', 1, '怀旧剧场'),
(502, '112114-成龙作品集', '成龙作品集', 1, '成龙作品集'),
(503, '112114-揭阳生活', '揭阳生活', 1, '揭阳生活'),
(504, '112114-揭阳综合', '揭阳综合', 1, '揭阳综合'),
(505, '112114-摄影', '摄影', 1, '摄影'),
(506, '112114-数少儿动漫', '数少儿动漫', 1, '数少儿动漫'),
(507, '112114-文化精品', '文化精品', 1, '文化精品'),
(508, '112114-文物宝库', '文物宝库', 1, '文物宝库'),
(509, '112114-新片放映厅', '新片放映厅', 1, '新片放映厅'),
(510, '112114-新疆体育健康', '新疆体育健康', 1, '新疆体育健康'),
(511, '112114-新疆卫视', '新疆卫视', 1, '新疆卫视'),
(512, '112114-新疆少儿', '新疆少儿', 1, '新疆少儿'),
(513, '112114-新疆汉语影视', '新疆汉语影视', 1, '新疆汉语影视'),
(514, '112114-新疆汉语经济', '新疆汉语经济', 1, '新疆汉语经济'),
(515, '112114-新疆汉语综艺', '新疆汉语综艺', 1, '新疆汉语综艺'),
(516, '112114-新科动漫', '新科动漫', 1, '新科动漫'),
(517, '112114-新视觉', '新视觉', 1, '新视觉'),
(518, '112114-旅游卫视', '旅游卫视', 1, '旅游卫视'),
(519, '112114-无线新闻', '无线新闻', 1, '无线新闻'),
(520, '112114-无线财经', '无线财经', 1, '无线财经'),
(521, '112114-无锡娱乐', '无锡娱乐', 1, '无锡娱乐'),
(522, '112114-无锡生活', '无锡生活', 1, '无锡生活'),
(523, '112114-无锡经济', '无锡经济', 1, '无锡经济'),
(524, '112114-早期教育', '早期教育', 1, '早期教育'),
(525, '112114-时代出行', '时代出行', 1, '时代出行'),
(526, '112114-时代家居', '时代家居', 1, '时代家居'),
(527, '112114-时代风尚', '时代风尚', 1, '时代风尚'),
(528, '112114-昆明教育', '昆明教育', 1, '昆明教育'),
(529, '112114-昆明综合', '昆明综合', 1, '昆明综合'),
(530, '112114-明珠台', '明珠台', 1, '明珠台'),
(531, '112114-星卫HD电影', '星卫HD电影', 1, '星卫HD电影'),
(532, '112114-星卫娱乐', '星卫娱乐', 1, '星卫娱乐'),
(533, '112114-星空卫视', '星空卫视', 1, '星空卫视'),
(534, '112114-智林体育', '智林体育', 1, '智林体育'),
(535, '112114-曼联电视', '曼联电视', 1, '曼联电视'),
(536, '112114-曼迪日本', '曼迪日本', 1, '曼迪日本'),
(537, '112114-杭州导视', '杭州导视', 1, '杭州导视'),
(538, '112114-杭州影视', '杭州影视', 1, '杭州影视'),
(539, '112114-杭州房产', '杭州房产', 1, '杭州房产'),
(540, '112114-杭州文化', '杭州文化', 1, '杭州文化'),
(541, '112114-杭州生活', '杭州生活', 1, '杭州生活'),
(542, '112114-杭州综合', '杭州综合', 1, '杭州综合'),
(543, '112114-杭州青少体育', '杭州青少体育', 1, '杭州青少体育'),
(544, '112114-梅州-1', '梅州-1', 1, '梅州-1'),
(545, '112114-梅迪奇艺术', '梅迪奇艺术', 1, '梅迪奇艺术'),
(546, '112114-梨园', '梨园', 1, '梨园'),
(547, '112114-欢笑剧场', '欢笑剧场', 1, '欢笑剧场'),
(548, '112114-欧美影院', '欧美影院', 1, '欧美影院'),
(549, '112114-正德电视台', '正德电视台', 1, '正德电视台'),
(550, '112114-武术世界', '武术世界', 1, '武术世界'),
(551, '112114-武汉外语', '武汉外语', 1, '武汉外语'),
(552, '112114-武汉少儿', '武汉少儿', 1, '武汉少儿'),
(553, '112114-武汉教育电视台', '武汉教育电视台', 1, '武汉教育电视台'),
(554, '112114-武汉文体', '武汉文体', 1, '武汉文体'),
(555, '112114-武汉新闻综合', '武汉新闻综合', 1, '武汉新闻综合'),
(556, '112114-武汉电视剧', '武汉电视剧', 1, '武汉电视剧'),
(557, '112114-武汉科技生活', '武汉科技生活', 1, '武汉科技生活'),
(558, '112114-武汉经济', '武汉经济', 1, '武汉经济'),
(559, '112114-武进新闻', '武进新闻', 1, '武进新闻'),
(560, '112114-武进生活', '武进生活', 1, '武进生活'),
(561, '112114-民视', '民视', 1, '民视'),
(562, '112114-民视台湾台', '民视台湾台', 1, '民视台湾台'),
(563, '112114-民视新闻台', '民视新闻台', 1, '民视新闻台'),
(564, '112114-民视第一台', '民视第一台', 1, '民视第一台'),
(565, '112114-民视综艺台', '民视综艺台', 1, '民视综艺台'),
(566, '112114-求索动物', '求索动物', 1, '求索动物'),
(567, '112114-求索科学', '求索科学', 1, '求索科学'),
(568, '112114-求索记录', '求索记录', 1, '求索记录'),
(569, '112114-汕头文旅体育', '汕头文旅体育', 1, '汕头文旅体育'),
(570, '112114-汕头经济生活', '汕头经济生活', 1, '汕头经济生活'),
(571, '112114-汕头综合', '汕头综合', 1, '汕头综合'),
(572, '112114-汕尾文化生活', '汕尾文化生活', 1, '汕尾文化生活'),
(573, '112114-汕尾新闻综合', '汕尾新闻综合', 1, '汕尾新闻综合'),
(574, '112114-江苏休闲体育', '江苏休闲体育', 1, '江苏休闲体育'),
(575, '112114-江苏优漫卡通', '江苏优漫卡通', 1, '江苏优漫卡通'),
(576, '112114-江苏卫视', '江苏卫视', 1, '江苏卫视'),
(577, '112114-江苏国际', '江苏国际', 1, '江苏国际'),
(578, '112114-江苏城市', '江苏城市', 1, '江苏城市'),
(579, '112114-江苏影视', '江苏影视', 1, '江苏影视'),
(580, '112114-江苏教育电视台', '江苏教育电视台', 1, '江苏教育电视台'),
(581, '112114-江苏综艺', '江苏综艺', 1, '江苏综艺'),
(582, '112114-江西公共农业', '江西公共农业', 1, '江西公共农业'),
(583, '112114-江西卫视', '江西卫视', 1, '江西卫视'),
(584, '112114-江西少儿', '江西少儿', 1, '江西少儿'),
(585, '112114-江西影视旅游', '江西影视旅游', 1, '江西影视旅游'),
(586, '112114-江西教育', '江西教育', 1, '江西教育'),
(587, '112114-江西新闻', '江西新闻', 1, '江西新闻'),
(588, '112114-江西旅游影视', '江西旅游影视', 1, '江西旅游影视'),
(589, '112114-江西电视指南', '江西电视指南', 1, '江西电视指南'),
(590, '112114-江西移动', '江西移动', 1, '江西移动'),
(591, '112114-江西经济生活', '江西经济生活', 1, '江西经济生活'),
(592, '112114-江西都市', '江西都市', 1, '江西都市'),
(593, '112114-江门侨乡生活', '江门侨乡生活', 1, '江门侨乡生活'),
(594, '112114-江门综合', '江门综合', 1, '江门综合'),
(595, '112114-汽摩', '汽摩', 1, '汽摩'),
(596, '112114-沈阳新闻', '沈阳新闻', 1, '沈阳新闻'),
(597, '112114-沈阳综合', '沈阳综合', 1, '沈阳综合'),
(598, '112114-河北公共', '河北公共', 1, '河北公共'),
(599, '112114-河北农民', '河北农民', 1, '河北农民'),
(600, '112114-河北卫视', '河北卫视', 1, '河北卫视'),
(601, '112114-河北少儿科教', '河北少儿科教', 1, '河北少儿科教'),
(602, '112114-河北影视', '河北影视', 1, '河北影视'),
(603, '112114-河北经济', '河北经济', 1, '河北经济'),
(604, '112114-河北都市', '河北都市', 1, '河北都市'),
(605, '112114-河南乡村', '河南乡村', 1, '河南乡村'),
(606, '112114-河南公共', '河南公共', 1, '河南公共'),
(607, '112114-河南卫视', '河南卫视', 1, '河南卫视'),
(608, '112114-河南国际', '河南国际', 1, '河南国际'),
(609, '112114-河南新农村', '河南新农村', 1, '河南新农村'),
(610, '112114-河南新闻', '河南新闻', 1, '河南新闻'),
(611, '112114-河南梨园', '河南梨园', 1, '河南梨园'),
(612, '112114-河南民生', '河南民生', 1, '河南民生'),
(613, '112114-河南法治', '河南法治', 1, '河南法治'),
(614, '112114-河南电视剧', '河南电视剧', 1, '河南电视剧'),
(615, '112114-河南都市', '河南都市', 1, '河南都市'),
(616, '112114-河源公共', '河源公共', 1, '河源公共'),
(617, '112114-河源综合', '河源综合', 1, '河源综合'),
(618, '112114-法治天地', '法治天地', 1, '法治天地'),
(619, '112114-泰州一套', '泰州一套', 1, '泰州一套'),
(620, '112114-泰州三套', '泰州三套', 1, '泰州三套'),
(621, '112114-泸州新闻综合', '泸州新闻综合', 1, '泸州新闻综合'),
(622, '112114-济南鲁中', '济南鲁中', 1, '济南鲁中'),
(623, '112114-浙江公共新闻', '浙江公共新闻', 1, '浙江公共新闻'),
(624, '112114-浙江卫视', '浙江卫视', 1, '浙江卫视'),
(625, '112114-浙江国际', '浙江国际', 1, '浙江国际'),
(626, '112114-浙江少儿', '浙江少儿', 1, '浙江少儿'),
(627, '112114-浙江影视', '浙江影视', 1, '浙江影视'),
(628, '112114-浙江教科影视', '浙江教科影视', 1, '浙江教科影视'),
(629, '112114-浙江数码时代', '浙江数码时代', 1, '浙江数码时代'),
(630, '112114-浙江民生', '浙江民生', 1, '浙江民生'),
(631, '112114-浙江民生休闲', '浙江民生休闲', 1, '浙江民生休闲'),
(632, '112114-浙江经济生活', '浙江经济生活', 1, '浙江经济生活'),
(633, '112114-浙江经视', '浙江经视', 1, '浙江经视'),
(634, '112114-浙江钱江都市', '浙江钱江都市', 1, '浙江钱江都市'),
(635, '112114-海南公共', '海南公共', 1, '海南公共'),
(636, '112114-海南卫视', '海南卫视', 1, '海南卫视'),
(637, '112114-海南少儿', '海南少儿', 1, '海南少儿'),
(638, '112114-海南文旅', '海南文旅', 1, '海南文旅'),
(639, '112114-海南新闻', '海南新闻', 1, '海南新闻'),
(640, '112114-海峡卫视', '海峡卫视', 1, '海峡卫视'),
(641, '112114-淮南公共', '淮南公共', 1, '淮南公共'),
(642, '112114-淮南新闻综合', '淮南新闻综合', 1, '淮南新闻综合'),
(643, '112114-深圳体育健康', '深圳体育健康', 1, '深圳体育健康'),
(644, '112114-深圳公共', '深圳公共', 1, '深圳公共'),
(645, '112114-深圳卫视', '深圳卫视', 1, '深圳卫视'),
(646, '112114-深圳国际', '深圳国际', 1, '深圳国际'),
(647, '112114-深圳娱乐', '深圳娱乐', 1, '深圳娱乐'),
(648, '112114-深圳少儿', '深圳少儿', 1, '深圳少儿'),
(649, '112114-深圳电视剧', '深圳电视剧', 1, '深圳电视剧'),
(650, '112114-深圳财经', '深圳财经', 1, '深圳财经'),
(651, '112114-深圳财经生活', '深圳财经生活', 1, '深圳财经生活'),
(652, '112114-深圳都市', '深圳都市', 1, '深圳都市'),
(653, '112114-深视体育健康', '深视体育健康', 1, '深视体育健康'),
(654, '112114-清远公共', '清远公共', 1, '清远公共'),
(655, '112114-清远新闻综合', '清远新闻综合', 1, '清远新闻综合'),
(656, '112114-游戏竞技', '游戏竞技', 1, '游戏竞技'),
(657, '112114-游戏风云', '游戏风云', 1, '游戏风云'),
(658, '112114-湖北公共·新闻', '湖北公共·新闻', 1, '湖北公共·新闻'),
(659, '112114-湖北卫视', '湖北卫视', 1, '湖北卫视'),
(660, '112114-湖北垄上', '湖北垄上', 1, '湖北垄上'),
(661, '112114-湖北影视', '湖北影视', 1, '湖北影视'),
(662, '112114-湖北教育', '湖北教育', 1, '湖北教育'),
(663, '112114-湖北生活', '湖北生活', 1, '湖北生活'),
(664, '112114-湖北经济', '湖北经济', 1, '湖北经济'),
(665, '112114-湖北综合', '湖北综合', 1, '湖北综合'),
(666, '112114-湖南卫视', '湖南卫视', 1, '湖南卫视'),
(667, '112114-湖南卫视国际', '湖南卫视国际', 1, '湖南卫视国际'),
(668, '112114-湖南国际', '湖南国际', 1, '湖南国际'),
(669, '112114-湖南娱乐', '湖南娱乐', 1, '湖南娱乐'),
(670, '112114-湖南教育', '湖南教育', 1, '湖南教育'),
(671, '112114-湖南教育台', '湖南教育台', 1, '湖南教育台'),
(672, '112114-湖南教育电视台', '湖南教育电视台', 1, '湖南教育电视台'),
(673, '112114-湖南爱晚', '湖南爱晚', 1, '湖南爱晚'),
(674, '112114-湖南电影', '湖南电影', 1, '湖南电影'),
(675, '112114-湖南电视剧', '湖南电视剧', 1, '湖南电视剧'),
(676, '112114-湖南经视', '湖南经视', 1, '湖南经视'),
(677, '112114-湖南都市', '湖南都市', 1, '湖南都市'),
(678, '112114-湖州新闻综合', '湖州新闻综合', 1, '湖州新闻综合'),
(679, '112114-湛江公共', '湛江公共', 1, '湛江公共'),
(680, '112114-湛江综合', '湛江综合', 1, '湛江综合'),
(681, '112114-滨州民生', '滨州民生', 1, '滨州民生'),
(682, '112114-滨州综合', '滨州综合', 1, '滨州综合'),
(683, '112114-潮安综合', '潮安综合', 1, '潮安综合'),
(684, '112114-潮州民生', '潮州民生', 1, '潮州民生'),
(685, '112114-潮州综合', '潮州综合', 1, '潮州综合'),
(686, '112114-爱体育', '爱体育', 1, '爱体育'),
(687, '112114-爱动漫', '爱动漫', 1, '爱动漫'),
(688, '112114-爱历史', '爱历史', 1, '爱历史'),
(689, '112114-爱喜剧', '爱喜剧', 1, '爱喜剧'),
(690, '112114-爱大剧', '爱大剧', 1, '爱大剧'),
(691, '112114-爱奇谈', '爱奇谈', 1, '爱奇谈'),
(692, '112114-爱尔达体育1', '爱尔达体育1', 1, '爱尔达体育1'),
(693, '112114-爱尔达体育2', '爱尔达体育2', 1, '爱尔达体育2'),
(694, '112114-爱尔达体育3', '爱尔达体育3', 1, '爱尔达体育3'),
(695, '112114-爱尔达娱乐台', '爱尔达娱乐台', 1, '爱尔达娱乐台'),
(696, '112114-爱尔达影剧', '爱尔达影剧', 1, '爱尔达影剧'),
(697, '112114-爱尔达综合', '爱尔达综合', 1, '爱尔达综合'),
(698, '112114-爱幼教', '爱幼教', 1, '爱幼教'),
(699, '112114-爱悬疑', '爱悬疑', 1, '爱悬疑'),
(700, '112114-爱旅行', '爱旅行', 1, '爱旅行'),
(701, '112114-爱浪漫', '爱浪漫', 1, '爱浪漫'),
(702, '112114-爱玩具', '爱玩具', 1, '爱玩具'),
(703, '112114-爱电影', '爱电影', 1, '爱电影'),
(704, '112114-爱科学', '爱科学', 1, '爱科学'),
(705, '112114-爱科幻', '爱科幻', 1, '爱科幻'),
(706, '112114-爱谍战', '爱谍战', 1, '爱谍战'),
(707, '112114-爱赛车', '爱赛车', 1, '爱赛车'),
(708, '112114-爱院线', '爱院线', 1, '爱院线'),
(709, '112114-环宇电影', '环宇电影', 1, '环宇电影'),
(710, '112114-环球奇观', '环球奇观', 1, '环球奇观'),
(711, '112114-环球旅游', '环球旅游', 1, '环球旅游'),
(712, '112114-现代女性', '现代女性', 1, '现代女性'),
(713, '112114-珠江', '珠江', 1, '珠江'),
(714, '112114-珠海新闻', '珠海新闻', 1, '珠海新闻'),
(715, '112114-珠海生活', '珠海生活', 1, '珠海生活'),
(716, '112114-甘肃公共', '甘肃公共', 1, '甘肃公共'),
(717, '112114-甘肃卫视', '甘肃卫视', 1, '甘肃卫视'),
(718, '112114-甘肃少儿', '甘肃少儿', 1, '甘肃少儿'),
(719, '112114-甘肃文化影视', '甘肃文化影视', 1, '甘肃文化影视'),
(720, '112114-甘肃经济', '甘肃经济', 1, '甘肃经济'),
(721, '112114-甘肃都市', '甘肃都市', 1, '甘肃都市'),
(722, '112114-生命', '生命', 1, '生命'),
(723, '112114-生态环境', '生态环境', 1, '生态环境'),
(724, '112114-生活时尚', '生活时尚', 1, '生活时尚'),
(725, '112114-电竞天堂', '电竞天堂', 1, '电竞天堂'),
(726, '112114-电视指南', '电视指南', 1, '电视指南'),
(727, '112114-留学世界', '留学世界', 1, '留学世界'),
(728, '112114-百姓健康', '百姓健康', 1, '百姓健康'),
(729, '112114-百色综合', '百色综合', 1, '百色综合'),
(730, '112114-盐城一套', '盐城一套', 1, '盐城一套'),
(731, '112114-盐城三套', '盐城三套', 1, '盐城三套'),
(732, '112114-盐城二套', '盐城二套', 1, '盐城二套'),
(733, '112114-睛彩中原', '睛彩中原', 1, '睛彩中原'),
(734, '112114-睛彩竞技', '睛彩竞技', 1, '睛彩竞技'),
(735, '112114-睛彩篮球', '睛彩篮球', 1, '睛彩篮球'),
(736, '112114-睛彩羽毛球', '睛彩羽毛球', 1, '睛彩羽毛球'),
(737, '112114-石家庄娱乐', '石家庄娱乐', 1, '石家庄娱乐'),
(738, '112114-石家庄新闻综合', '石家庄新闻综合', 1, '石家庄新闻综合'),
(739, '112114-石家庄生活', '石家庄生活', 1, '石家庄生活'),
(740, '112114-石家庄都市', '石家庄都市', 1, '石家庄都市'),
(741, '112114-福州少儿', '福州少儿', 1, '福州少儿'),
(742, '112114-福州影视', '福州影视', 1, '福州影视'),
(743, '112114-福州新闻', '福州新闻', 1, '福州新闻'),
(744, '112114-福建体育', '福建体育', 1, '福建体育'),
(745, '112114-福建公共', '福建公共', 1, '福建公共'),
(746, '112114-福建少儿', '福建少儿', 1, '福建少儿'),
(747, '112114-福建文体', '福建文体', 1, '福建文体'),
(748, '112114-福建新闻', '福建新闻', 1, '福建新闻'),
(749, '112114-福建旅游', '福建旅游', 1, '福建旅游'),
(750, '112114-福建电视剧', '福建电视剧', 1, '福建电视剧'),
(751, '112114-福建经济', '福建经济', 1, '福建经济'),
(752, '112114-福建综合', '福建综合', 1, '福建综合'),
(753, '112114-移动戏曲', '移动戏曲', 1, '移动戏曲'),
(754, '112114-第一剧场', '第一剧场', 1, '第一剧场'),
(755, '112114-第一财经', '第一财经', 1, '第一财经'),
(756, '112114-篮球', '篮球', 1, '篮球'),
(757, '112114-精品剧场', '精品剧场', 1, '精品剧场'),
(758, '112114-红色轮播', '红色轮播', 1, '红色轮播'),
(759, '112114-纬来精采', '纬来精采', 1, '纬来精采'),
(760, '112114-纯享4K', '纯享4K', 1, '纯享4K'),
(761, '112114-经典剧场', '经典剧场', 1, '经典剧场'),
(762, '112114-经济科教', '经济科教', 1, '经济科教'),
(763, '112114-置业', '置业', 1, '置业'),
(764, '112114-美亚高清电影台', '美亚高清电影台', 1, '美亚高清电影台'),
(765, '112114-美食星球', '美食星球', 1, '美食星球'),
(766, '112114-翡翠台', '翡翠台', 1, '翡翠台'),
(767, '112114-老故事', '老故事', 1, '老故事'),
(768, '112114-肇庆新闻', '肇庆新闻', 1, '肇庆新闻'),
(769, '112114-肇庆生活服务', '肇庆生活服务', 1, '肇庆生活服务'),
(770, '112114-苏州新闻综合', '苏州新闻综合', 1, '苏州新闻综合'),
(771, '112114-苏州社会经济', '苏州社会经济', 1, '苏州社会经济'),
(772, '112114-茂名公共', '茂名公共', 1, '茂名公共'),
(773, '112114-茂名综合', '茂名综合', 1, '茂名综合'),
(774, '112114-茶', '茶', 1, '茶'),
(775, '112114-莆田一套', '莆田一套', 1, '莆田一套'),
(776, '112114-莆田二套', '莆田二套', 1, '莆田二套'),
(777, '112114-莱芜综合', '莱芜综合', 1, '莱芜综合'),
(778, '112114-莲花卫视', '莲花卫视', 1, '莲花卫视'),
(779, '112114-衢州公共', '衢州公共', 1, '衢州公共'),
(780, '112114-衢州新闻综合', '衢州新闻综合', 1, '衢州新闻综合'),
(781, '112114-西安丝路', '西安丝路', 1, '西安丝路'),
(782, '112114-西安商务资迅', '西安商务资迅', 1, '西安商务资迅'),
(783, '112114-西安影视', '西安影视', 1, '西安影视'),
(784, '112114-西安新闻综合', '西安新闻综合', 1, '西安新闻综合'),
(785, '112114-西安移动电视', '西安移动电视', 1, '西安移动电视'),
(786, '112114-西安都市', '西安都市', 1, '西安都市'),
(787, '112114-西藏卫视', '西藏卫视', 1, '西藏卫视'),
(788, '112114-西藏影视文化', '西藏影视文化', 1, '西藏影视文化'),
(789, '112114-证券资讯', '证券资讯', 1, '证券资讯'),
(790, '112114-象视界', '象视界', 1, '象视界'),
(791, '112114-财富天下', '财富天下', 1, '财富天下'),
(792, '112114-贵州公共', '贵州公共', 1, '贵州公共'),
(793, '112114-贵州卫视', '贵州卫视', 1, '贵州卫视'),
(794, '112114-贵州大众生活', '贵州大众生活', 1, '贵州大众生活'),
(795, '112114-贵州影视文艺', '贵州影视文艺', 1, '贵州影视文艺'),
(796, '112114-贵州法制', '贵州法制', 1, '贵州法制'),
(797, '112114-赣州一套', '赣州一套', 1, '赣州一套'),
(798, '112114-赣州公共', '赣州公共', 1, '赣州公共'),
(799, '112114-赣州四套', '赣州四套', 1, '赣州四套'),
(800, '112114-赣州教育', '赣州教育', 1, '赣州教育'),
(801, '112114-车迷', '车迷', 1, '车迷'),
(802, '112114-辽宁体育', '辽宁体育', 1, '辽宁体育'),
(803, '112114-辽宁公共', '辽宁公共', 1, '辽宁公共'),
(804, '112114-辽宁北方', '辽宁北方', 1, '辽宁北方'),
(805, '112114-辽宁卫视', '辽宁卫视', 1, '辽宁卫视'),
(806, '112114-辽宁影视剧', '辽宁影视剧', 1, '辽宁影视剧'),
(807, '112114-辽宁生活', '辽宁生活', 1, '辽宁生活'),
(808, '112114-辽宁经济', '辽宁经济', 1, '辽宁经济'),
(809, '112114-辽宁都市', '辽宁都市', 1, '辽宁都市'),
(810, '112114-辽宁青少', '辽宁青少', 1, '辽宁青少'),
(811, '112114-达文西', '达文西', 1, '达文西'),
(812, '112114-追剧少女', '追剧少女', 1, '追剧少女'),
(813, '112114-都市剧场', '都市剧场', 1, '都市剧场'),
(814, '112114-采昌影剧', '采昌影剧', 1, '采昌影剧'),
(815, '112114-重庆农村', '重庆农村', 1, '重庆农村'),
(816, '112114-重庆卫视', '重庆卫视', 1, '重庆卫视'),
(817, '112114-重庆国际', '重庆国际', 1, '重庆国际'),
(818, '112114-重庆少儿', '重庆少儿', 1, '重庆少儿'),
(819, '112114-重庆影视', '重庆影视', 1, '重庆影视'),
(820, '112114-重庆文体娱乐', '重庆文体娱乐', 1, '重庆文体娱乐'),
(821, '112114-重庆新闻', '重庆新闻', 1, '重庆新闻'),
(822, '112114-重庆时尚生活', '重庆时尚生活', 1, '重庆时尚生活'),
(823, '112114-重庆生活资讯', '重庆生活资讯', 1, '重庆生活资讯'),
(824, '112114-重庆社会与法', '重庆社会与法', 1, '重庆社会与法'),
(825, '112114-重庆科教', '重庆科教', 1, '重庆科教'),
(826, '112114-金华公共', '金华公共', 1, '金华公共'),
(827, '112114-金华新闻综合', '金华新闻综合', 1, '金华新闻综合'),
(828, '112114-金色学堂', '金色学堂', 1, '金色学堂'),
(829, '112114-金鹰卡通', '金鹰卡通', 1, '金鹰卡通'),
(830, '112114-金鹰纪实', '金鹰纪实', 1, '金鹰纪实'),
(831, '112114-银川公共', '银川公共', 1, '银川公共'),
(832, '112114-银川文体', '银川文体', 1, '银川文体'),
(833, '112114-银川生活', '银川生活', 1, '银川生活'),
(834, '112114-锦州公共', '锦州公共', 1, '锦州公共'),
(835, '112114-锦州新闻', '锦州新闻', 1, '锦州新闻'),
(836, '112114-锦州都市', '锦州都市', 1, '锦州都市'),
(837, '112114-长春综合', '长春综合', 1, '长春综合'),
(838, '112114-长沙公共', '长沙公共', 1, '长沙公共'),
(839, '112114-长沙女性', '长沙女性', 1, '长沙女性'),
(840, '112114-长沙影视', '长沙影视', 1, '长沙影视'),
(841, '112114-长沙政法', '长沙政法', 1, '长沙政法'),
(842, '112114-长沙新闻', '长沙新闻', 1, '长沙新闻'),
(843, '112114-长沙知音', '长沙知音', 1, '长沙知音'),
(844, '112114-长沙经贸', '长沙经贸', 1, '长沙经贸'),
(845, '112114-阳光卫视', '阳光卫视', 1, '阳光卫视'),
(846, '112114-陕西一套', '陕西一套', 1, '陕西一套'),
(847, '112114-陕西七套', '陕西七套', 1, '陕西七套'),
(848, '112114-陕西三套', '陕西三套', 1, '陕西三套'),
(849, '112114-陕西二套', '陕西二套', 1, '陕西二套'),
(850, '112114-陕西五套', '陕西五套', 1, '陕西五套'),
(851, '112114-陕西八套', '陕西八套', 1, '陕西八套'),
(852, '112114-陕西六套', '陕西六套', 1, '陕西六套'),
(853, '112114-陕西农林卫视', '陕西农林卫视', 1, '陕西农林卫视'),
(854, '112114-陕西卫视', '陕西卫视', 1, '陕西卫视'),
(855, '112114-陕西四套', '陕西四套', 1, '陕西四套'),
(856, '112114-陕西影视', '陕西影视', 1, '陕西影视'),
(857, '112114-青年学苑', '青年学苑', 1, '青年学苑'),
(858, '112114-青海卫视', '青海卫视', 1, '青海卫视'),
(859, '112114-青海都市', '青海都市', 1, '青海都市'),
(860, '112114-靖天卡通台', '靖天卡通台', 1, '靖天卡通台'),
(861, '112114-靖天国际', '靖天国际', 1, '靖天国际'),
(862, '112114-靖天戏剧台', '靖天戏剧台', 1, '靖天戏剧台'),
(863, '112114-靖天日本台', '靖天日本台', 1, '靖天日本台'),
(864, '112114-靖天映画', '靖天映画', 1, '靖天映画'),
(865, '112114-靖天欢乐台', '靖天欢乐台', 1, '靖天欢乐台'),
(866, '112114-靖天电影台', '靖天电影台', 1, '靖天电影台'),
(867, '112114-靖天综合台', '靖天综合台', 1, '靖天综合台'),
(868, '112114-靖天育乐台', '靖天育乐台', 1, '靖天育乐台'),
(869, '112114-靖天资讯台', '靖天资讯台', 1, '靖天资讯台'),
(870, '112114-靖洋卡通台', '靖洋卡通台', 1, '靖洋卡通台'),
(871, '112114-靖洋戏剧台', '靖洋戏剧台', 1, '靖洋戏剧台'),
(872, '112114-韩国娱乐台KMTV', '韩国娱乐台KMTV', 1, '韩国娱乐台KMTV'),
(873, '112114-韶关新闻', '韶关新闻', 1, '韶关新闻'),
(874, '112114-风云剧场', '风云剧场', 1, '风云剧场'),
(875, '112114-风云足球', '风云足球', 1, '风云足球'),
(876, '112114-风云音乐', '风云音乐', 1, '风云音乐'),
(877, '112114-高尔夫网球', '高尔夫网球', 1, '高尔夫网球'),
(878, '112114-高清大片', '高清大片', 1, '高清大片'),
(879, '112114-魅力足球', '魅力足球', 1, '魅力足球'),
(880, '112114-黄河卫视', '黄河卫视', 1, '黄河卫视'),
(881, '112114-黑莓动画', '黑莓动画', 1, '黑莓动画'),
(882, '112114-黑莓电影', '黑莓电影', 1, '黑莓电影'),
(883, '112114-黑龙江公共农业', '黑龙江公共农业', 1, '黑龙江公共农业'),
(884, '112114-黑龙江卫视', '黑龙江卫视', 1, '黑龙江卫视'),
(885, '112114-黑龙江少儿', '黑龙江少儿', 1, '黑龙江少儿'),
(886, '112114-黑龙江影视', '黑龙江影视', 1, '黑龙江影视'),
(887, '112114-黑龙江文体', '黑龙江文体', 1, '黑龙江文体'),
(888, '112114-黑龙江新闻法制', '黑龙江新闻法制', 1, '黑龙江新闻法制'),
(889, '112114-黑龙江新闻法治', '黑龙江新闻法治', 1, '黑龙江新闻法治'),
(890, '112114-黑龙江都市', '黑龙江都市', 1, '黑龙江都市'),
(891, '112114-龙华偶像', '龙华偶像', 1, '龙华偶像'),
(892, '112114-龙华动画', '龙华动画', 1, '龙华动画'),
(893, '112114-龙华影剧', '龙华影剧', 1, '龙华影剧'),
(894, '112114-龙华戏剧', '龙华戏剧', 1, '龙华戏剧'),
(895, '112114-龙华日韩台', '龙华日韩台', 1, '龙华日韩台'),
(896, '112114-龙华洋片', '龙华洋片', 1, '龙华洋片'),
(897, '112114-龙华电影', '龙华电影', 1, '龙华电影'),
(898, '112114-龙华经典', '龙华经典', 1, '龙华经典'),
(899, '112114-龙岩综合', '龙岩综合', 1, '龙岩综合'),
(900, '112114-龙祥时代', '龙祥时代', 1, '龙祥时代');

-- --------------------------------------------------------

--
-- 表的结构 `iptv_meals`
--

CREATE TABLE `iptv_meals` (
  `id` int(11) NOT NULL,
  `name` varchar(128) NOT NULL,
  `amount` int(4) NOT NULL DEFAULT 0,
  `days` int(4) NOT NULL DEFAULT 0,
  `content` text DEFAULT NULL,
  `status` tinyint(1) NOT NULL DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 转存表中的数据 `iptv_meals`
--

INSERT INTO `iptv_meals` (`id`, `name`, `amount`, `days`, `content`, `status`) VALUES
(1000, '试看套餐', 1, 30, '央视频道', 1),
(1002, '会员套餐', 7, 999, '央视频道_卫视频道_其他频道_重庆_河南_广东_湖北_河北_安徽_江西_黑龙江_天津_上海_山西_吉林_江苏_福建_海南_贵州_云南_陕西_西藏_宁夏_内蒙古_北京_湖南_广西_甘肃_浙江_新疆_山东_四川_隐藏频道', 1);

-- --------------------------------------------------------

--
-- 表的结构 `iptv_payment`
--

CREATE TABLE `iptv_payment` (
  `userid` bigint(20) NOT NULL,
  `order_id` varchar(128) NOT NULL,
  `meal` int(4) NOT NULL,
  `days` int(4) NOT NULL,
  `status` tinyint(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- 表的结构 `iptv_users`
--

CREATE TABLE `iptv_users` (
  `id` int(11) NOT NULL,
  `name` bigint(20) NOT NULL,
  `mac` varchar(32) NOT NULL,
  `deviceid` varchar(32) NOT NULL,
  `model` varchar(32) NOT NULL,
  `ip` varchar(46) NOT NULL,
  `region` varchar(32) DEFAULT NULL,
  `exp` bigint(20) NOT NULL,
  `vpn` tinyint(5) NOT NULL DEFAULT 0,
  `idchange` tinyint(5) NOT NULL DEFAULT 0,
  `author` varchar(16) DEFAULT NULL,
  `authortime` bigint(20) NOT NULL DEFAULT 0,
  `status` int(4) NOT NULL DEFAULT -1,
  `lasttime` bigint(20) NOT NULL,
  `marks` varchar(16) DEFAULT NULL,
  `meal` int(11) NOT NULL DEFAULT 1000
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 转储表的索引
--

--
-- 表的索引 `dsmtv_movie`
--
ALTER TABLE `dsmtv_movie`
  ADD PRIMARY KEY (`id`) USING BTREE;

--
-- 表的索引 `iptv_admin`
--
ALTER TABLE `iptv_admin`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `iptv_adminrec`
--
ALTER TABLE `iptv_adminrec`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `iptv_category`
--
ALTER TABLE `iptv_category`
  ADD UNIQUE KEY `name` (`name`);

--
-- 表的索引 `iptv_channels`
--
ALTER TABLE `iptv_channels`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `iptv_config`
--
ALTER TABLE `iptv_config`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `iptv_epg`
--
ALTER TABLE `iptv_epg`
  ADD PRIMARY KEY (`id`) USING BTREE;

--
-- 表的索引 `iptv_meals`
--
ALTER TABLE `iptv_meals`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `iptv_users`
--
ALTER TABLE `iptv_users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `mac` (`mac`,`deviceid`);

--
-- 在导出的表使用AUTO_INCREMENT
--

--
-- 使用表AUTO_INCREMENT `dsmtv_movie`
--
ALTER TABLE `dsmtv_movie`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- 使用表AUTO_INCREMENT `iptv_admin`
--
ALTER TABLE `iptv_admin`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- 使用表AUTO_INCREMENT `iptv_adminrec`
--
ALTER TABLE `iptv_adminrec`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=40;

--
-- 使用表AUTO_INCREMENT `iptv_channels`
--
ALTER TABLE `iptv_channels`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=757;

--
-- 使用表AUTO_INCREMENT `iptv_config`
--
ALTER TABLE `iptv_config`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=45;

--
-- 使用表AUTO_INCREMENT `iptv_epg`
--
ALTER TABLE `iptv_epg`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=37;

--
-- 使用表AUTO_INCREMENT `iptv_meals`
--
ALTER TABLE `iptv_meals`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=1003;

--
-- 使用表AUTO_INCREMENT `iptv_users`
--
ALTER TABLE `iptv_users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
